console.log("12" + 34); // Результат буде рядком '1234'. Оператор + використовується для конкатенації рядків, якщо один з операндів є рядком.

console.log(12 + 34); // Результат буде числом 46. У цьому випадку оператор + використовується для додавання чисел.

console.log(100 / "10"); //Результат буде числом 10. JavaScript спробує автоматично конвертувати рядок '10' в число, оскільки / використовується для ділення чисел.

console.log(100 * "f"); //Результат буде NaN. Оскільки ми намагаємося помножити число на рядок, який не може бути конвертований в число.

console.log("7" / null); //Результат буде числом Infinity. При діленні будь-якого числа на null, null автоматично конвертується в 0, і отримуємо ділення на нуль, що повертає Infinity.
